; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	infrared1 - mode
	Star3 - direction
	Star4 - direction
	Star0 - direction
	GroundStation2 - direction
	Star5 - direction
	Star1 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star4)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star6)
	(supports instrument5 image0)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(pointing satellite1 Phenomenon13)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 infrared1)
	(have_image Planet9 image0)
	(have_image Star10 image0)
	(have_image Phenomenon11 infrared1)
	(have_image Star12 image0)
	(have_image Phenomenon13 infrared1)
	(have_image Planet14 image0)
	(have_image Star15 infrared1)
	(have_image Star16 image0)
	(have_image Planet17 image0)
))

)

; plan
1. (turn_to satellite1 groundstation2 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 12
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite1 planet17 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet17)
   goals met: 0 of 12
5. (take_image satellite1 planet17 instrument3 image0)
   added: (have_image planet17 image0)
   goals met: 1 of 12
6. (turn_to satellite1 planet14 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet14)
   goals met: 1 of 12
7. (take_image satellite1 planet14 instrument3 image0)
   added: (have_image planet14 image0)
   goals met: 2 of 12
8. (turn_to satellite1 phenomenon7 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 12
9. (take_image satellite1 phenomenon7 instrument3 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 3 of 12
10. (turn_to satellite1 phenomenon11 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 12
11. (take_image satellite1 phenomenon11 instrument3 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 4 of 12
12. (turn_to satellite1 planet9 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet9)
   goals met: 4 of 12
13. (take_image satellite1 planet9 instrument3 image0)
   added: (have_image planet9 image0)
   goals met: 5 of 12
14. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 5 of 12
15. (take_image satellite1 star10 instrument3 image0)
   added: (have_image star10 image0)
   goals met: 6 of 12
16. (turn_to satellite1 star12 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star12)
   goals met: 6 of 12
17. (take_image satellite1 star12 instrument3 image0)
   added: (have_image star12 image0)
   goals met: 7 of 12
18. (turn_to satellite1 star15 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star15)
   goals met: 7 of 12
19. (take_image satellite1 star15 instrument3 infrared1)
   added: (have_image star15 infrared1)
   goals met: 8 of 12
20. (turn_to satellite1 star16 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star16)
   goals met: 8 of 12
21. (take_image satellite1 star16 instrument3 image0)
   added: (have_image star16 image0)
   goals met: 9 of 12
22. (turn_to satellite1 star8 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star8)
   goals met: 9 of 12
23. (take_image satellite1 star8 instrument3 infrared1)
   added: (have_image star8 infrared1)
   goals met: 10 of 12
24. (turn_to satellite1 phenomenon13 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon13)
   goals met: 11 of 12
25. (take_image satellite1 phenomenon13 instrument3 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 12 of 12
